# CurtainSystemType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainSystemType Class
Members See Also
---
An object that represents CurtainSystem type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CurtainSystemType : HostObjAttributes
```

Visual Basic
---
```text
Public Class CurtainSystemType _
	Inherits HostObjAttributes
```

Visual C++
---
```text
public ref class CurtainSystemType : public HostObjAttributes
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..CurtainSystemType
# See Also
CurtainSystemType Members
Autodesk.Revit.DB Namespace